Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=620_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Johanna Njaita
smn: Muu nommâ lii Johanna Njaita já lam 22-ihásâš.

source: Tulen Ruotsista eteläsaamen alueelta pienestä kylästä nimeltä Hemavan.
smn: Puáđám Ruotâst maadâsämikuávlust uccâ siijdâst, mon nommâ lii Hemavan.

source: Se sijaitsee kahdenkymmenen kilometrin päässä Tärnabystä.
smn: Tot lii kyevtilov kilomeetter keččin Tärnabyst.

source: Olen itse uumajansaamelainen, mutta olen opiskellut eteläsaamea ensimmäiseltä luokalta lähtien Tärnabyn saamelaiskoulussa.
smn: Lam jieš umesämmilâš, mut lam luuhâm maadâsämikielâ vuossâmuu luoka rääjist Tärnaby sämiškoovlâst.

source: Koulussa ei ollut uumajansaamen opettajaa, joten emme voineet opiskella omaa kieltämme.
smn: Škoovlâst ij lamaš umesämikielâ máttáátteijee, et ep puáhtám luuhâđ jieččân kielâ.

source: Uumajansaame on erittäin pieni ja uhanalainen kieli ja sen puhujia ei ole montaa.
smn: Umesämikielâ lii uáli uccâ já uhkevuálásâš kielâ já ton sárnooh iä lah maŋgâ.

source: Tällä hetkellä asun Jokkmokkissa, jossa opiskelen Sámij åhpadusguovdásjissa (saamelaisten koulutuskeskus), keskittyen nahkaan ja tekstiileihin.
smn: Tääl aasâm Jokkmokkist (Juhâmokke), mast luuhim Sámij åhpadusguovdásjist (Säämi máttáátâskuávdáš), válduamnâsin nähki já tekstiileh.

source: Sámij åhpadusguovdásjiin meno on antanut minulle paljon, sillä olen oppinut paljon perinteisistä käsitöistä.
smn: Säämi máttáátâskuávdážân moonnâm lii adelâm munjin ennuv, ko lam oppâm ennuv ärbivuáviljn tuojijn.

source: Täällä oppii myös paljon saamelaisten historiasta ja muista saamelaisalueista, sekä saamelaisista perinteistä.
smn: Tääbbin uáppá še ennuv sämmilij historjást já eres sämikuávluin, sehe säämi ärbivuovijn.

source: Ennen kun aloitin opiskeluni Sámij åhpadusguovdásjissa, opiskelin Sollefteåssa, joka sijaitsee Ruotsin keskiosassa.
smn: Ovdil ko algâttim oopâid Säämi máttáátâskuávdáást, te luuhim Sollefteåst, mii lii Ruotâ koskâuásist.

source: Siellä opiskelin saamelaiskäsitöiden muotoilua ja Alpine linea.
smn: Tobbeen oppim sämituojij hammim já Alpine line.

source: Kuäydessäni saamelaiskäsityökoulua, minulla ei ollut saamelaisia opettajia, vaan minun täytyi usein soittaa äidille kotiin ja kysyä mitä ja miten pitää jokin tehdä.
smn: Ko juuttim sämityejiškoovlâ, te must iä lamaš sämmilâš máttáátteijeeh, pic mun ferttejim távjá suáittiđ pááikán iänán já koijâdiđ maid já maht kalga mon-uv porgâđ.

source: Opiskelun aloittaminen Jokkmokkissa vaikutti minuun siten, että kehityin siellä huomattavasti erityisesti käsityön saralla, sillä siellä oli saamelaisia opettajia.
smn: Oopâi algâttem Juhâmohheest vaikuttij munjin nuuvt, et ovdánim tobbeen uáli pyereest, eromâšávt tyeje syergist, ko tobbeen lijjii sämmilâš máttáátteijeeh.

source: Saamelaisena oleminen on suuri osa identiteettiäni.
smn: Ko mun lam sämmilâš, te tot lii stuorrâ uási muu identiteet.

source: Kasvoin siihen, enkä voisi kuvitella elämääni ilman saamelaisuutta.
smn: Šoddim toos, jiemge puávtáččii jurdâččiđ jieččân eellim sämmilâšvuođâttáá.

source: Saamelaisuuteni on vahvistunut paljon aloitettuani opiskelut Jokkmokkissa, sillä kuulen saamenkieltä päivittäin ja olen päässyt mukaan saamelaiskäsitöihin.
smn: Ko algâttim oopâid Juhâmohheest, te tot lii nanodâm čuuvtij muu sämmilâšvuođâ, ko kuulâm sämikielâ piäiválávt já lam peessâm siisâ sämituojijd.

source: Kotialueellani ei ole kovin montaa, jotka puhuvat saamenkieltä julkisesti.
smn: Muu päikkikuávlust iä lah meendugin maŋgâ ulmuu, kiäh sárnuh almolávt sämikielâ.

source: Minulle kieli on erittäin tärkeä ja toivon sen vahvistuvan tulevaisuudessa.
smn: Munjin kielâ lii uáli tehálâš já tuáivum, et tot nanosmuvá puátteevuođâst.

source: Uskon, että tulevaisuus näyttää hyvältä siltä kannalta, että saamenkielen vahvistamiseen saadaan paljon resursseja.
smn: Oskom, et puátteevuotâ niävttá pyerrin ton tááhust, et sämikielâ naanoodmân uážžup ennuv resurssijd.

source: Nykypäivänä monet nuoret pyrkivät vahvistamaan kieltänsä, mutta selkeästi tarvitsemme enemmän.
smn: Onnáá peeivi maaŋgah nuorah viggeh nanodiđ kielâs, mut čielgâsávt tarbâšep eenâb.

source: Uskon ja toivon, että pystymme vahvistamaan saamenkieltä entistä enemmän tulevaisuudessa.
smn: Oskom já tuáivum, et nahcip nanodiđ sämikielâ vala-uv eenâb puátteevuođâst.

source: Uskon niin, sillä saamelaisilla on niin vahva yhteenkuuluvuuden tunne, vaikka meidät onkin jaettu neljään eri maahan.
smn: Oskom nuuvt, ko sämmilijn lii nuuvt noonâ oohtânkulluuvâšvuođâ tobdo, veikkâ mii lep-uv juohum neelji sierânâs enâmân.
